clackups/draftling/firmware/sdkconfig.defaults.freenove_fnk0104a
# CMakePresets.json board defaults: Freenove FNK0104A
# Sets the hardware model and IDF target used by the "freenove_fnk0104a" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_FREENOVE_FNK0104A=y

# "SD card via USB" (F1 menu): expose the on-board MicroSD as a USB
# Mass Storage device over the ESP32-S3's native USB port. See
# components/usb_msc.
CONFIG_TINYUSB_MSC_ENABLED=y
